{
    "Changes": [
        {
            "Action": "EditData",
            "Target": "data/mail",
            "Entries": {
                "{{ModID}}.EFurnaceMail": "Hey there!^^   Looking to take your mining game to the next level? Look no further as we are finally expanding our technologies to all across Stardew Valley! Get your hands on our latest electric furnaces series and the blueprints at your nearest carpenter shop!^^   -EcoSparks Technologies^^^(Electric furnace and its alternator version, pulverizer, ceramic kiln, combustion generator and pulverizers are now available at Robin's shop. It's recommended to purchase ceramic kiln first.)[#]EcoSparks' Expanding to Stardew Valley!",
                "{{ModId}}.InitChromiumQuest": "Hello^^   I kinda need your help. Could you please spare three prismatic shards? I'm working on a chromium furnace project and these shards are crucial to make chromium bars, one of the materials. Your assistance would be greatly appreciated.^^   -Clint %item quest 413271801 %%[#]Clint's Request for New Furnace",
                "{{ModID}}.GardenClocheMail": "Dear farmer @,^^   We would like to congratulate you for your dedicated efforts in shipping 300 of the same crop! We have also included a blueprint of a garden cloche that allow you to grow crops in its contained space without worry of season or space!^   Please keep doing Yoba's work and thank you very much again for your contributions!^^   -Ferngill Republic Agriculture Department %item craftingRecipe Garden_Cloche %%[#]Letter From Government: Garden Cloche",
                "{{ModID}}.SuperGardenMail": "Dear farmer @,^^   We're excited to inform you that you've now shipped over 777 units of the same crop! Your dedication to cultivating these fantastic fruits and vegetables hasn't gone unnoticed. As a token of appreciation, we're thrilled to offer you an upgraded version of the garden cloche, enabling even more crops to thrive under your care!^   At the Ferngill Republic Agricultural Department, we value your hard work and commitment to agricultural excellence. Your contributions to our farming community are truly appreciated!^   Keep up the great work!^^   -Ferngill Republic Agricultural Department %item craftingRecipe Super_Garden_Cloche %%[#]Letter From Government: Super Garden Cloche",
                "{{ModID}}.DistilleryMail": "Dear customer!^^   If you are looking to up your brewing games, we are happy to announce that industrial distillery is now available at 'Pierre's'!^   They brew two times faster than kegs and produce the best quality beverage you will ever taste!^^   -Pierre[#]Pierre's Ads: Industrial Distillery",
                "{{ModID}}.PressMail": "Dear customer!^^   Do you love pickled veggies? Or how about jams? Or aged roes? Tired of how long they take to make?^   Fear not! Preservative presses are now available at 'Pierre's' for everyone interested in quicker preservation and better quality products for a fair price!^^   -Pierre[#]Pierre's Ads: Preservative Press",
                "{{ModID}}.TreeClocheMail": "Hey there,^^   Just letting you know that I got a new item for you... It's called \"Tree Cloche\". They allow you to get wood just from wild tree seeds which makes it easier for automation processes. Come visit my shop if you're interested!^^   -Robin[#]Tree Cloches Are Now Available!",
                "{{ModID}}.ChroFurnaceMail": "Hey, @^^   Things went better than expected. Seems like chromium bars can be made by smelting chromium compound, which I've also attached its recipe with the mail.^   I've tested the furnace and it performs noticeably faster than normal furnaces. I also noticed that I got two bars instead of one, but maybe that was just me testing while drunk and forgetting it?^   Anyway, I can't express my thank enough for your help so I've attached a blueprint for the furnace plus a chromium furnace that I made with the remainders!^^   -Clint %item craftingRecipe Chromium_Furnace %% %item craftingRecipe Chromium_Compound %% %item object (BC){{ModID}}.ChromiumFurnace 1 %%[#]A Thank You From Clint",
                "{{ModID}}.HayBinMail": "Dear @,^   Winter is coming very soon so I thought this might be useful for you. It can be used to make hay from fiber, which will be very useful in winter!^^   -Marnie %item craftingRecipe Hay_Bin %%[#]A Gift For Neighbor For Use In Fall",
                "{{ModID}}.HayRehydratorMail": "Dear @,^   The year is coming closer to an end so here's something for you that might be of use. It can be used to make fiber from hay, which can be very useful if you plan to make grass starters yourself!^^   -Marnie %item craftingRecipe Hay_Rehydrator %%[#]A Gift For Neighbor For Use In Winter",
                "{{ModID}}.GemPolisherMail": "Hi @,^^   Thank you for your gem donations! As token of appreciation, I wanna give you this recipe I found while cleaning library. According to the book, it can improve the quality of your gems.^   I hope this is useful to you!^^   -Gunther %item craftingRecipe Gem_Polisher %%[#]Thank You For Gem Donations",
                "{{ModID}}.MineralWasherMail": "Hi @,^^   Thank you for your mineral donations! I've attached one of the blueprints that might be useful to you as appreciation. According to the book, it can improve the quality of your minerals.^   I hope this is useful to you!^^   -Gunther %item craftingRecipe Mineral_Washer %%[#]Thank You For Mineral Donations",
                "{{ModID}}.SeedMakersMail": "Hey @, I've found some farming books that include blueprints of seed maker variations. If you want, I can sell them back to you for only a quarter of book's price!^^   -Pierre[#]Seed Makers Variations Now For Sale!",

                //New in 1.1.0
                "{{ModID}}.ChroHFurnaceMail": "Hey @^^One of my sources say you've finally fully honed your mining skills. So I've got a recipe that might interest you.^^     -???^     -EcoSparks Lab %item craftingRecipe Chromium_Heavy_Furnace %%[#]Letter from Unknown",
                "{{ModID}}.AQUAMail": "Farmer @,^^   I'm writing this to let you know that your local fisherman shop now has two of our latest project inventions:\"Fish Catcher\" and gas-utilizing \"Fish Smoker\".^   Do not hesitate to share your opinion on our latest project by dialing our support: N3XUS-22351.^^   -???, AQUA Co.^^P.S. I forgot to mention that gas for your Fish Smokers will be provided free of charge.[letterbg Mods/{{ModID}}/assets/letterbg 0][#]A Letter From AQUA Co."
            }
        }
    ]
}